RT-Thread/rt-thread/bsp/lpc178x/drivers/lpc177x_8x_uart.c
    /* FIFOs are empty */
    UARTx->FCR = ( UART_FCR_FIFO_EN | UART_FCR_RX_RS | UART_FCR_TX_RS);

    // Disable FIFO
    UARTx->FCR = 0;

    // Dummy reading
    while (UARTx->LSR & UART_LSR_RDR)
    {
        tmp = UARTx->RBR;
    }

    UARTx->TER = UART_TER_TXEN;

    // Wait for current transmit complete
    while (!(UARTx->LSR & UART_LSR_THRE));

    // Disable Tx
    UARTx->TER = 0;

    // Disable interrupt
    UARTx->IER = 0;

    // Set LCR to default state
    UARTx->LCR = 0;

    // Set ACR to default state
    UARTx->ACR = 0;

    // Set RS485 control to default state
    UARTx->RS485CTRL = 0;

    // Set RS485 delay timer to default state
    UARTx->RS485DLY = 0;

    // Set RS485 addr match to default state
    UARTx->ADRMATCH = 0;

    // Dummy reading
    tmp = UARTx->LSR;

    if(((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        // Set Modem Control to default state
        ((LPC_UART1_TypeDef *)UARTx)->MCR = 0;

        //Dummy Reading to Clear Status
        tmp = ((LPC_UART1_TypeDef *)UARTx)->MSR;
    }
    else
    {
        // Set IrDA to default state for all UART other than UART1
        UARTx->ICR = 0;
    }

    // Set Line Control register ----------------------------

    uart_set_divisors(UARTx, (UART_ConfigStruct->Baud_rate));

    if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        tmp = (((LPC_UART1_TypeDef *)UARTx)->LCR & (UART_LCR_DLAB_EN | UART_LCR_BREAK_EN)) \
                                                    & UART_LCR_BITMASK;
    }
    else
    {
        tmp = (UARTx->LCR & (UART_LCR_DLAB_EN | UART_LCR_BREAK_EN)) & UART_LCR_BITMASK;
    }

    switch (UART_ConfigStruct->Databits)
    {
        case UART_DATABIT_5:
            tmp |= UART_LCR_WLEN5;
            break;

        case UART_DATABIT_6:
            tmp |= UART_LCR_WLEN6;
            break;

        case UART_DATABIT_7:
            tmp |= UART_LCR_WLEN7;
            break;

        case UART_DATABIT_8:

        default:
            tmp |= UART_LCR_WLEN8;
            break;
    }

    if (UART_ConfigStruct->Parity == UART_PARITY_NONE)
    {
        // Do nothing...
    }
    else
    {
        tmp |= UART_LCR_PARITY_EN;
        switch (UART_ConfigStruct->Parity)
        {
            case UART_PARITY_ODD:
                tmp |= UART_LCR_PARITY_ODD;
                break;

            case UART_PARITY_EVEN:
                tmp |= UART_LCR_PARITY_EVEN;
                break;

            case UART_PARITY_SP_1:
                tmp |= UART_LCR_PARITY_F_1;
                break;

            case UART_PARITY_SP_0:
                tmp |= UART_LCR_PARITY_F_0;
                break;

            default:
                break;
        }
    }

    switch (UART_ConfigStruct->Stopbits)
    {
        case UART_STOPBIT_2:
            tmp |= UART_LCR_STOPBIT_SEL;
            break;

        case UART_STOPBIT_1:

        default:
            // Do no thing
            break;
    }


    // Write back to LCR, configure FIFO and Disable Tx
    if (((LPC_UART1_TypeDef *)UARTx) ==  LPC_UART1)
    {
        ((LPC_UART1_TypeDef *)UARTx)->LCR = (uint8_t)(tmp & UART_LCR_BITMASK);
    }
    else
    {
        UARTx->LCR = (uint8_t)(tmp & UART_LCR_BITMASK);
    }
}

/*********************************************************************//**
 * @brief        De-initializes the UARTx peripheral registers to their
 *                  default reset values.
 * @param[in]    UARTx    UART peripheral selected, should be:
 *               - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @return         None
 **********************************************************************/
void UART_DeInit(LPC_UART_TypeDef* UARTx)
{
    UART_TxCmd(UARTx, DISABLE);

    if (UARTx == LPC_UART0)
    {
        /* Set up clock and power for UART module */
        CLKPWR_ConfigPPWR (CLKPWR_PCONP_PCUART0, DISABLE);
    }

    if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        /* Set up clock and power for UART module */
        CLKPWR_ConfigPPWR (CLKPWR_PCONP_PCUART1, DISABLE);
    }

    if (UARTx == LPC_UART2)
    {
        /* Set up clock and power for UART module */
        CLKPWR_ConfigPPWR (CLKPWR_PCONP_PCUART2, DISABLE);
    }

    if (UARTx == LPC_UART3)
    {
        /* Set up clock and power for UART module */
        CLKPWR_ConfigPPWR (CLKPWR_PCONP_PCUART3, DISABLE);
    }
}

/*****************************************************************************//**
* @brief        Fills each UART_InitStruct member with its default value:
*                 - 9600 bps
*                 - 8-bit data
*                 - 1 Stopbit
*                 - None Parity
* @param[in]    UART_InitStruct Pointer to a UART_CFG_Type structure
*                    which will be initialized.
* @return        None
*******************************************************************************/
void UART_ConfigStructInit(UART_CFG_Type *UART_InitStruct)
{
    UART_InitStruct->Baud_rate = 9600;

    UART_InitStruct->Databits = UART_DATABIT_8;

    UART_InitStruct->Parity = UART_PARITY_NONE;

    UART_InitStruct->Stopbits = UART_STOPBIT_1;
}

/* UART Send/Recieve functions -------------------------------------------------*/
/*********************************************************************//**
 * @brief        Transmit a single data through UART peripheral
 * @param[in]    UARTx    UART peripheral selected, should be:
 *               - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @param[in]    Data    Data to transmit (must be 8-bit long)
 * @return         None
 **********************************************************************/
void UART_SendByte(LPC_UART_TypeDef* UARTx, uint8_t Data)
{
    if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        ((LPC_UART1_TypeDef *)UARTx)->THR = Data & UART_THR_MASKBIT;
    }
    else
    {
        UARTx->THR = Data & UART_THR_MASKBIT;
    }

