RT-Thread/rt-thread/bsp/lpc178x/drivers/lpc177x_8x_uart.c
}


/*********************************************************************//**
 * @brief        Receive a single data from UART peripheral
 * @param[in]    UARTx    UART peripheral selected, should be:
 *              - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @return         Data received
 **********************************************************************/
uint8_t UART_ReceiveByte(LPC_UART_TypeDef* UARTx)
{
    if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        return (((LPC_UART1_TypeDef *)UARTx)->RBR & UART_RBR_MASKBIT);
    }
    else
    {
        return (UARTx->RBR & UART_RBR_MASKBIT);
    }
}

/*********************************************************************//**
 * @brief        Send a block of data via UART peripheral
 * @param[in]    UARTx    Selected UART peripheral used to send data, should be:
 *               - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @param[in]    txbuf     Pointer to Transmit buffer
 * @param[in]    buflen     Length of Transmit buffer
 * @param[in]     flag     Flag used in  UART transfer, should be
 *                         NONE_BLOCKING or BLOCKING
 * @return         Number of bytes sent.
 *
 * Note: when using UART in BLOCKING mode, a time-out condition is used
 * via defined symbol UART_BLOCKING_TIMEOUT.
 **********************************************************************/
uint32_t UART_Send(LPC_UART_TypeDef *UARTx, uint8_t *txbuf,
                            uint32_t buflen, TRANSFER_BLOCK_Type flag)
{
    uint32_t bToSend, bSent, timeOut, fifo_cnt;
    uint8_t *pChar = txbuf;

    bToSend = buflen;

    // blocking mode
    if (flag == BLOCKING)
    {
        bSent = 0;
        while (bToSend)
        {
            timeOut = UART_BLOCKING_TIMEOUT;

            // Wait for THR empty with timeout
            while (!(UARTx->LSR & UART_LSR_THRE))
            {
                if (timeOut == 0)
                    break;

                timeOut--;
            }

            // Time out!
            if(timeOut == 0)
                break;

            fifo_cnt = UART_TX_FIFO_SIZE;

            while (fifo_cnt && bToSend)
            {
                UART_SendByte(UARTx, (*pChar++));

                fifo_cnt--;

                bToSend--;

                bSent++;
            }
        }
    }

    // None blocking mode
    else
    {
        bSent = 0;
        while (bToSend)
        {
            if (bToSend == 0)
                break;

            if (!(UARTx->LSR & UART_LSR_THRE))
            {
                break;
            }

            fifo_cnt = UART_TX_FIFO_SIZE;

            while (fifo_cnt && bToSend)
            {
                UART_SendByte(UARTx, (*pChar++));

                bToSend--;

                fifo_cnt--;

                bSent++;
            }
        }
    }

    return bSent;
}

/*********************************************************************//**
 * @brief        Receive a block of data via UART peripheral
 * @param[in]    UARTx    Selected UART peripheral used to send data,
 *                 should be:
 *               - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @param[out]    rxbuf     Pointer to Received buffer
 * @param[in]    buflen     Length of Received buffer
 * @param[in]     flag     Flag mode, should be NONE_BLOCKING or BLOCKING

 * @return         Number of bytes received
 *
 * Note: when using UART in BLOCKING mode, a time-out condition is used
 * via defined symbol UART_BLOCKING_TIMEOUT.
 **********************************************************************/
uint32_t UART_Receive(LPC_UART_TypeDef *UARTx, uint8_t *rxbuf,
                                uint32_t buflen, TRANSFER_BLOCK_Type flag)
{
    uint32_t bToRecv, bRecv, timeOut;
    uint8_t *pChar = rxbuf;

    bToRecv = buflen;

    // Blocking mode
    if (flag == BLOCKING)
    {
        bRecv = 0;
        while (bToRecv)
        {
            timeOut = UART_BLOCKING_TIMEOUT;
            while (!(UARTx->LSR & UART_LSR_RDR))
            {
                if (timeOut == 0)
                    break;

                timeOut--;
            }

            // Time out!
            if(timeOut == 0)
                break;

            // Get data from the buffer
            (*pChar++) = UART_ReceiveByte(UARTx);

            bToRecv--;

            bRecv++;
        }
    }
    // None blocking mode
    else
    {
        bRecv = 0;
        while (bToRecv)
        {
            if (!(UARTx->LSR & UART_LSR_RDR))
            {
                break;
            }
            else
            {
                (*pChar++) = UART_ReceiveByte(UARTx);

                bRecv++;

                bToRecv--;
            }
        }
    }

    return bRecv;
}

/*********************************************************************//**
 * @brief        Force BREAK character on UART line, output pin UARTx TXD is
                forced to logic 0.
 * @param[in]    UARTx    UART peripheral selected, should be:
 *              - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @return         None
 **********************************************************************/
void UART_ForceBreak(LPC_UART_TypeDef* UARTx)
{
    if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        ((LPC_UART1_TypeDef *)UARTx)->LCR |= UART_LCR_BREAK_EN;
    }
    else
    {
        UARTx->LCR |= UART_LCR_BREAK_EN;
    }
}


/********************************************************************//**
 * @brief         Enable or disable specified UART interrupt.
 * @param[in]    UARTx    UART peripheral selected, should be
 *              - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @param[in]    UARTIntCfg    Specifies the interrupt flag,
 *                 should be one of the following:
                - UART_INTCFG_RBR     :  RBR Interrupt enable
                - UART_INTCFG_THRE     :  THR Interrupt enable
                - UART_INTCFG_RLS     :  RX line status interrupt enable
                - UART1_INTCFG_MS    :  Modem status interrupt enable (UART1 only)
                - UART1_INTCFG_CTS    :  CTS1 signal transition interrupt enable (UART1 only)
                - UART_INTCFG_ABEO     :  Enables the end of auto-baud interrupt
                - UART_INTCFG_ABTO     :  Enables the auto-baud time-out interrupt
 * @param[in]    NewState New state of specified UART interrupt type,
 *                 should be:
 *                 - ENALBE: Enable this UART interrupt type.
*                 - DISALBE: Disable this UART interrupt type.
 * @return         None
 *********************************************************************/
void UART_IntConfig(LPC_UART_TypeDef *UARTx, UART_INT_Type UARTIntCfg, FunctionalState NewState)
{
    uint32_t tmp;

