RT-Thread/rt-thread/bsp/lpc178x/drivers/lpc177x_8x_uart.c
    switch(UARTIntCfg)
    {
        case UART_INTCFG_RBR:
            tmp = UART_IER_RBRINT_EN;
            break;

        case UART_INTCFG_THRE:
            tmp = UART_IER_THREINT_EN;
            break;

        case UART_INTCFG_RLS:
            tmp = UART_IER_RLSINT_EN;
            break;

        case UART1_INTCFG_MS:
            tmp = UART1_IER_MSINT_EN;
            break;

        case UART1_INTCFG_CTS:
            tmp = UART1_IER_CTSINT_EN;
            break;

        case UART_INTCFG_ABEO:
            tmp = UART_IER_ABEOINT_EN;
            break;

        case UART_INTCFG_ABTO:
            tmp = UART_IER_ABTOINT_EN;
            break;
    }

    if (NewState == ENABLE)
    {
        if ((LPC_UART1_TypeDef *) UARTx == LPC_UART1)
        {
            ((LPC_UART1_TypeDef *)UARTx)->IER |= tmp;
        }
        else
        {
            UARTx->IER |= tmp;
        }
    }
    else
    {
        if ((LPC_UART1_TypeDef *) UARTx == LPC_UART1)
        {
            ((LPC_UART1_TypeDef *)UARTx)->IER &= (~tmp) & UART1_IER_BITMASK;
        }
        else
        {
            UARTx->IER &= (~tmp) & UART_IER_BITMASK;
        }
    }
}


/********************************************************************//**
 * @brief         Get current value of Line Status register in UART peripheral.
 * @param[in]    UARTx    UART peripheral selected, should be:
 *              - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @return        Current value of Line Status register in UART peripheral.
 * Note:    The return value of this function must be ANDed with each member in
 *             UART_LS_Type enumeration to determine current flag status
 *             corresponding to each Line status type. Because some flags in
 *             Line Status register will be cleared after reading, the next reading
 *             Line Status register could not be correct. So this function used to
 *             read Line status register in one time only, then the return value
 *             used to check all flags.
 *********************************************************************/
uint8_t UART_GetLineStatus(LPC_UART_TypeDef* UARTx)
{
    if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        return ((((LPC_UART1_TypeDef *)LPC_UART1)->LSR) & UART_LSR_BITMASK);
    }
    else
    {
        return ((UARTx->LSR) & UART_LSR_BITMASK);
    }
}

/********************************************************************//**
 * @brief         Get Interrupt Identification value
 * @param[in]    UARTx    UART peripheral selected, should be:
 *              - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @return        Current value of UART UIIR register in UART peripheral.
 *********************************************************************/
uint32_t UART_GetIntId(LPC_UART_TypeDef* UARTx)
{
    return (UARTx->IIR & 0x03CF);
}

/*********************************************************************//**
 * @brief        Check whether if UART is busy or not
 * @param[in]    UARTx    UART peripheral selected, should be:
 *              - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @return        RESET if UART is not busy, otherwise return SET.
 **********************************************************************/
FlagStatus UART_CheckBusy(LPC_UART_TypeDef *UARTx)
{
    if (UARTx->LSR & UART_LSR_TEMT)
    {
        return RESET;
    }
    else
    {
        return SET;
    }
}


/*********************************************************************//**
 * @brief        Configure FIFO function on selected UART peripheral
 * @param[in]    UARTx    UART peripheral selected, should be:
 *              - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @param[in]    FIFOCfg    Pointer to a UART_FIFO_CFG_Type Structure that
 *                         contains specified information about FIFO configuration
 * @return         none
 **********************************************************************/
void UART_FIFOConfig(LPC_UART_TypeDef *UARTx, UART_FIFO_CFG_Type *FIFOCfg)
{
    uint8_t tmp = 0;

    tmp |= UART_FCR_FIFO_EN;

    switch (FIFOCfg->FIFO_Level)
    {
        case UART_FIFO_TRGLEV0:
            tmp |= UART_FCR_TRG_LEV0;
            break;

        case UART_FIFO_TRGLEV1:
            tmp |= UART_FCR_TRG_LEV1;
            break;

        case UART_FIFO_TRGLEV2:
            tmp |= UART_FCR_TRG_LEV2;
            break;

        case UART_FIFO_TRGLEV3:

        default:
            tmp |= UART_FCR_TRG_LEV3;
            break;
    }

    if (FIFOCfg->FIFO_ResetTxBuf == ENABLE)
    {
        tmp |= UART_FCR_TX_RS;
    }

    if (FIFOCfg->FIFO_ResetRxBuf == ENABLE)
    {
        tmp |= UART_FCR_RX_RS;
    }

    if (FIFOCfg->FIFO_DMAMode == ENABLE)
    {
        tmp |= UART_FCR_DMAMODE_SEL;
    }


    //write to FIFO control register
    if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        ((LPC_UART1_TypeDef *)UARTx)->FCR = tmp & UART_FCR_BITMASK;
    }
    else
    {
        UARTx->FCR = tmp & UART_FCR_BITMASK;
    }
}

/*****************************************************************************//**
* @brief        Fills each UART_FIFOInitStruct member with its default value:
*                 - FIFO_DMAMode = DISABLE
*                 - FIFO_Level = UART_FIFO_TRGLEV0
*                 - FIFO_ResetRxBuf = ENABLE
*                 - FIFO_ResetTxBuf = ENABLE
*                 - FIFO_State = ENABLE

* @param[in]    UART_FIFOInitStruct Pointer to a UART_FIFO_CFG_Type structure
*                    which will be initialized.
* @return        None
*******************************************************************************/
void UART_FIFOConfigStructInit(UART_FIFO_CFG_Type *UART_FIFOInitStruct)
{
    UART_FIFOInitStruct->FIFO_DMAMode = DISABLE;

