RT-Thread/rt-thread/bsp/lpc178x/drivers/lpc177x_8x_uart.c
    UART_FIFOInitStruct->FIFO_Level = UART_FIFO_TRGLEV0;

    UART_FIFOInitStruct->FIFO_ResetRxBuf = ENABLE;

    UART_FIFOInitStruct->FIFO_ResetTxBuf = ENABLE;
}


/*********************************************************************//**
 * @brief        Start/Stop Auto Baudrate activity
 * @param[in]    UARTx    UART peripheral selected, should be
 *               - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @param[in]    ABConfigStruct    A pointer to UART_AB_CFG_Type structure that
 *                                 contains specified information about UART
 *                                 auto baudrate configuration
 * @param[in]    NewState New State of Auto baudrate activity, should be:
 *                 - ENABLE: Start this activity
 *                - DISABLE: Stop this activity
 * Note:        Auto-baudrate mode enable bit will be cleared once this mode
 *                 completed.
 * @return         none
 **********************************************************************/
void UART_ABCmd(LPC_UART_TypeDef *UARTx, UART_AB_CFG_Type *ABConfigStruct,
                            FunctionalState NewState)
{
    uint32_t tmp;

    tmp = 0;
    if (NewState == ENABLE)
    {
        if (ABConfigStruct->ABMode == UART_AUTOBAUD_MODE1)
        {
            tmp |= UART_ACR_MODE;
        }
        if (ABConfigStruct->AutoRestart == ENABLE)
        {
            tmp |= UART_ACR_AUTO_RESTART;
        }
    }

    if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        if (NewState == ENABLE)
        {
            // Clear DLL and DLM value
            ((LPC_UART1_TypeDef *)UARTx)->LCR |= UART_LCR_DLAB_EN;

            ((LPC_UART1_TypeDef *)UARTx)->DLL = 0;

            ((LPC_UART1_TypeDef *)UARTx)->DLM = 0;

            ((LPC_UART1_TypeDef *)UARTx)->LCR &= ~UART_LCR_DLAB_EN;

            // FDR value must be reset to default value
            ((LPC_UART1_TypeDef *)UARTx)->FDR = 0x10;

            ((LPC_UART1_TypeDef *)UARTx)->ACR = UART_ACR_START | tmp;
        }
        else
        {
            ((LPC_UART1_TypeDef *)UARTx)->ACR = 0;
        }
    }
    else
    {
        if (NewState == ENABLE)
        {
            // Clear DLL and DLM value
            UARTx->LCR |= UART_LCR_DLAB_EN;

            UARTx->DLL = 0;

            UARTx->DLM = 0;

            UARTx->LCR &= ~UART_LCR_DLAB_EN;

            // FDR value must be reset to default value
            UARTx->FDR = 0x10;

            UARTx->ACR = UART_ACR_START | tmp;
        }
        else
        {
            UARTx->ACR = 0;
        }
    }
}

/*********************************************************************//**
 * @brief        Clear Autobaud Interrupt Pending
 * @param[in]    UARTx    UART peripheral selected, should be
 *               - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @param[in]    ABIntType    type of auto-baud interrupt, should be:
 *                 - UART_AUTOBAUD_INTSTAT_ABEO: End of Auto-baud interrupt
 *                 - UART_AUTOBAUD_INTSTAT_ABTO: Auto-baud time out interrupt
 * @return         none
 **********************************************************************/
void UART_ABClearIntPending(LPC_UART_TypeDef *UARTx, UART_ABEO_Type ABIntType)
{
    if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
    {
        UARTx->ACR |= ABIntType;
    }
    else
        UARTx->ACR |= ABIntType;
}

/*********************************************************************//**
 * @brief        Enable/Disable transmission on UART TxD pin
 * @param[in]    UARTx    UART peripheral selected, should be:
 *               - LPC_UART0: UART0 peripheral
 *                 - LPC_UART1: UART1 peripheral
 *                 - LPC_UART2: UART2 peripheral
 *                 - LPC_UART3: UART3 peripheral
 * @param[in]    NewState New State of Tx transmission function, should be:
 *                 - ENABLE: Enable this function
                - DISABLE: Disable this function
 * @return none
 **********************************************************************/
void UART_TxCmd(LPC_UART_TypeDef *UARTx, FunctionalState NewState)
{
    if (NewState == ENABLE)
    {
        if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
        {
            ((LPC_UART1_TypeDef *)UARTx)->TER |= UART_TER_TXEN;
        }
        else
        {
            UARTx->TER |= UART_TER_TXEN;
        }
    }
    else
    {
        if (((LPC_UART1_TypeDef *)UARTx) == LPC_UART1)
        {
            ((LPC_UART1_TypeDef *)UARTx)->TER &= (~UART_TER_TXEN) & UART_TER_BITMASK;
        }
        else
        {
            UARTx->TER &= (~UART_TER_TXEN) & UART_TER_BITMASK;
        }
    }
}

/* UART IrDA functions ---------------------------------------------------*/
/*********************************************************************//**
 * @brief        Enable or disable inverting serial input function of IrDA
 *                 on UART peripheral.
 * @param[in]    UARTx UART peripheral selected, should be LPC_UART3 (only)
 * @param[in]    NewState New state of inverting serial input, should be:
 *                 - ENABLE: Enable this function.
 *                 - DISABLE: Disable this function.
 * @return none
 **********************************************************************/
void UART_IrDAInvtInputCmd(LPC_UART_TypeDef* UARTx, FunctionalState NewState)
{
    if (NewState == ENABLE)
    {
        UARTx->ICR |= UART_ICR_IRDAINV;
    }
    else if (NewState == DISABLE)
    {
        UARTx->ICR &= (~UART_ICR_IRDAINV) & UART_ICR_BITMASK;
    }
}


/*********************************************************************//**
 * @brief        Enable or disable IrDA function on UART peripheral.
 * @param[in]    UARTx UART peripheral selected, should be LPC_UART3 (only)
 * @param[in]    NewState New state of IrDA function, should be:
 *                 - ENABLE: Enable this function.
 *                 - DISABLE: Disable this function.
 * @return none
 **********************************************************************/
void UART_IrDACmd(LPC_UART_TypeDef* UARTx, FunctionalState NewState)
{
    if (NewState == ENABLE)
    {
        UARTx->ICR |= UART_ICR_IRDAEN;
    }
    else
    {
        UARTx->ICR &= (~UART_ICR_IRDAEN) & UART_ICR_BITMASK;
    }
}


/*********************************************************************//**
 * @brief        Configure Pulse divider for IrDA function on UART peripheral.
 * @param[in]    UARTx UART peripheral selected, should be LPC_UART3 (only)
 * @param[in]    PulseDiv Pulse Divider value from Peripheral clock,
 *                 should be one of the following:
                - UART_IrDA_PULSEDIV2     : Pulse width = 2 * Tpclk
                - UART_IrDA_PULSEDIV4     : Pulse width = 4 * Tpclk
                - UART_IrDA_PULSEDIV8     : Pulse width = 8 * Tpclk
                - UART_IrDA_PULSEDIV16     : Pulse width = 16 * Tpclk
                - UART_IrDA_PULSEDIV32     : Pulse width = 32 * Tpclk
                - UART_IrDA_PULSEDIV64     : Pulse width = 64 * Tpclk
                - UART_IrDA_PULSEDIV128 : Pulse width = 128 * Tpclk
                - UART_IrDA_PULSEDIV256 : Pulse width = 256 * Tpclk

 * @return none
 **********************************************************************/
void UART_IrDAPulseDivConfig(LPC_UART_TypeDef *UARTx, UART_IrDA_PULSE_Type PulseDiv)
{
    uint32_t tmp, tmp1;

    tmp1 = UART_ICR_PULSEDIV(PulseDiv);

