RT-Thread/rt-thread/bsp/lpc178x/drivers/lpc177x_8x_uart.c
    tmp = UARTx->ICR & (~ UART_ICR_PULSEDIV(7));

    tmp |= tmp1 | UART_ICR_FIXPULSE_EN;

    UARTx->ICR = tmp & UART_ICR_BITMASK;
}

/* UART1 FullModem function ---------------------------------------------*/

/*********************************************************************//**
 * @brief        Force pin DTR/RTS corresponding to given state (Full modem mode)
 * @param[in]    UARTx    LPC_UART1 (only)
 * @param[in]    Pin    Pin that NewState will be applied to, should be:
 *                 - UART1_MODEM_PIN_DTR: DTR pin.
 *                 - UART1_MODEM_PIN_RTS: RTS pin.
 * @param[in]    NewState New State of DTR/RTS pin, should be:
 *                 - INACTIVE: Force the pin to inactive signal.
                - ACTIVE: Force the pin to active signal.
 * @return none
 **********************************************************************/
void UART_FullModemForcePinState(LPC_UART1_TypeDef *UARTx,
                                                    UART_MODEM_PIN_Type Pin,
                                                    UART1_SignalState NewState)
{
    uint8_t tmp = 0;

    switch (Pin)
    {
        case UART1_MODEM_PIN_DTR:
            tmp = UART1_MCR_DTR_CTRL;
            break;

        case UART1_MODEM_PIN_RTS:
            tmp = UART1_MCR_RTS_CTRL;
            break;

        default:
            break;
    }

    if (NewState == ACTIVE)
    {
        UARTx->MCR |= tmp;
    }
    else
    {
        UARTx->MCR &= (~tmp) & UART1_MCR_BITMASK;
    }
}


/*********************************************************************//**
 * @brief        Configure Full Modem mode for UART peripheral
 * @param[in]    UARTx    LPC_UART1 (only)
 * @param[in]    Mode Full Modem mode, should be:
 *                 - UART1_MODEM_MODE_LOOPBACK: Loop back mode.
 *                 - UART1_MODEM_MODE_AUTO_RTS: Auto-RTS mode.
 *                 - UART1_MODEM_MODE_AUTO_CTS: Auto-CTS mode.
 * @param[in]    NewState New State of this mode, should be:
 *                 - ENABLE: Enable this mode.
                - DISABLE: Disable this mode.
 * @return none
 **********************************************************************/
void UART_FullModemConfigMode(LPC_UART1_TypeDef *UARTx, UART_MODEM_MODE_Type Mode,
                                            FunctionalState NewState)
{
    uint8_t tmp;

    switch(Mode)
    {
        case UART1_MODEM_MODE_LOOPBACK:
            tmp = UART1_MCR_LOOPB_EN;
            break;

        case UART1_MODEM_MODE_AUTO_RTS:
            tmp = UART1_MCR_AUTO_RTS_EN;
            break;

        case UART1_MODEM_MODE_AUTO_CTS:
            tmp = UART1_MCR_AUTO_CTS_EN;
            break;

        default:
            break;
    }

    if (NewState == ENABLE)
    {
        UARTx->MCR |= tmp;
    }
    else
    {
        UARTx->MCR &= (~tmp) & UART1_MCR_BITMASK;
    }
}


/*********************************************************************//**
 * @brief        Get current status of modem status register
 * @param[in]    UARTx    LPC_UART1 (only)
 * @return         Current value of modem status register
 * Note:    The return value of this function must be ANDed with each member
 *             UART_MODEM_STAT_type enumeration to determine current flag status
 *             corresponding to each modem flag status. Because some flags in
 *             modem status register will be cleared after reading, the next reading
 *             modem register could not be correct. So this function used to
 *             read modem status register in one time only, then the return value
 *             used to check all flags.
 **********************************************************************/
uint8_t UART_FullModemGetStatus(LPC_UART1_TypeDef *UARTx)
{
    return ((UARTx->MSR) & UART1_MSR_BITMASK);
}


/* UART RS485 functions --------------------------------------------------------------*/

/*********************************************************************//**
 * @brief        Configure UART peripheral in RS485 mode according to the specified
*               parameters in the RS485ConfigStruct.
 * @param[in]    UARTx    LPC_UART1 (only)
 * @param[in]    RS485ConfigStruct Pointer to a UART1_RS485_CTRLCFG_Type structure
*                    that contains the configuration information for specified UART
*                    in RS485 mode.
 * @return        None
 **********************************************************************/
void UART_RS485Config(LPC_UART_TypeDef *UARTx, UART1_RS485_CTRLCFG_Type *RS485ConfigStruct)
{
    uint32_t tmp;

    tmp = 0;

    // If Auto Direction Control is enabled -  This function is used in Master mode
    if (RS485ConfigStruct->AutoDirCtrl_State == ENABLE)
    {
        tmp |= UART1_RS485CTRL_DCTRL_EN;

        // Set polar
        if (RS485ConfigStruct->DirCtrlPol_Level == SET)
        {
            tmp |= UART1_RS485CTRL_OINV_1;
        }

        // Set pin according to. This condition is only with UART1. The others are used
        // OE pin as default for control the direction of RS485 buffer IC
        if ((RS485ConfigStruct->DirCtrlPin == UART1_RS485_DIRCTRL_DTR)
                                && ((LPC_UART1_TypeDef *)UARTx == LPC_UART1))
        {
            tmp |= UART1_RS485CTRL_SEL_DTR;
        }

        // Fill delay time
        UARTx->RS485DLY = RS485ConfigStruct->DelayValue & UART1_RS485DLY_BITMASK;
    }

    // MultiDrop mode is enable
    if (RS485ConfigStruct->NormalMultiDropMode_State == ENABLE)
    {
        tmp |= UART1_RS485CTRL_NMM_EN;
    }

    // Auto Address Detect function
    if (RS485ConfigStruct->AutoAddrDetect_State == ENABLE)
    {
        tmp |= UART1_RS485CTRL_AADEN;

        // Fill Match Address
        UARTx->ADRMATCH = RS485ConfigStruct->MatchAddrValue & UART1_RS485ADRMATCH_BITMASK;
    }

    // Receiver is disable
    if (RS485ConfigStruct->Rx_State == DISABLE)
    {
        tmp |= UART1_RS485CTRL_RX_DIS;
    }

    // write back to RS485 control register
    UARTx->RS485CTRL = tmp & UART1_RS485CTRL_BITMASK;

    // Enable Parity function and leave parity in stick '0' parity as default
    UARTx->LCR |= (UART_LCR_PARITY_F_0 | UART_LCR_PARITY_EN);
}

/*********************************************************************//**
 * @brief        Enable/Disable receiver in RS485 module in UART1
 * @param[in]    UARTx    LPC_UART1 (only)
 * @param[in]    NewState    New State of command, should be:
 *                             - ENABLE: Enable this function.
 *                             - DISABLE: Disable this function.
 * @return        None
 **********************************************************************/
void UART_RS485ReceiverCmd(LPC_UART_TypeDef *UARTx, FunctionalState NewState)
{
    if (NewState == ENABLE)
    {
        UARTx->RS485CTRL &= ~UART1_RS485CTRL_RX_DIS;
    }
    else
    {
        UARTx->RS485CTRL |= UART1_RS485CTRL_RX_DIS;
    }
}

/*********************************************************************//**
 * @brief        Send data on RS485 bus with specified parity stick value (9-bit mode).
 * @param[in]    UARTx    LPC_UART1 (only)
 * @param[in]    pDatFrm     Pointer to data frame.
 * @param[in]    size        Size of data.
 * @param[in]    ParityStick    Parity Stick value, should be 0 or 1.
 * @return        None
 **********************************************************************/
uint32_t UART_RS485Send(LPC_UART_TypeDef *UARTx, uint8_t *pDatFrm,
                                            uint32_t size, uint8_t ParityStick)
{
    uint8_t tmp, save;
    uint32_t cnt;

    if (ParityStick)
    {
        save = tmp = UARTx->LCR & UART_LCR_BITMASK;

        tmp &= ~(UART_LCR_PARITY_EVEN);

        UARTx->LCR = tmp;

        cnt = UART_Send((LPC_UART_TypeDef *)UARTx, pDatFrm, size, BLOCKING);

        while (!(UARTx->LSR & UART_LSR_TEMT));

        UARTx->LCR = save;
    }
    else
    {
        cnt = UART_Send((LPC_UART_TypeDef *)UARTx, pDatFrm, size, BLOCKING);

        while (!(UARTx->LSR & UART_LSR_TEMT));
    }

    return cnt;
}

/*********************************************************************//**
 * @brief        Send Slave address frames on RS485 bus.
 * @param[in]    UARTx    LPC_UART1 (only)
 * @param[in]    SlvAddr Slave Address.
 * @return        None
 **********************************************************************/
void UART_RS485SendSlvAddr(LPC_UART_TypeDef *UARTx, uint8_t SlvAddr)
{
    UART_RS485Send(UARTx, &SlvAddr, 1, 1);
}

/*********************************************************************//**
 * @brief        Send Data frames on RS485 bus.
 * @param[in]    UARTx    LPC_UART1 (only)
 * @param[in]    pData Pointer to data to be sent.
 * @param[in]    size Size of data frame to be sent.
 * @return        None
 **********************************************************************/
uint32_t UART_RS485SendData(LPC_UART_TypeDef *UARTx, uint8_t *pData, uint32_t size)
{
    return (UART_RS485Send(UARTx, pData, size, 0));
}

/**
 * @}
 */

/**
 * @}
 */
/* --------------------------------- End Of File ------------------------------ */

